[Killed] BlockStatement
main/components/Commons/CommonsForm.js:13:4
   healthUpdateStrategies,
   register,
   testid,
-}) {
-  return (
-    <Form.Group className="mb-3">
-      <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          data-testid={`${testid}-${formName}`}
-          id={formName}
-          {...register(formName, {required: `${displayName} is required`})}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
-
-    </Form.Group>
-  );
-}
+}) {}
 
 
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: HealthUpdateStrategiesDropdown(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:17:8
   return (
     <Form.Group className="mb-3">
       <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          data-testid={`${testid}-${formName}`}
-          id={formName}
-          {...register(formName, {required: `${displayName} is required`})}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
+      {healthUpdateStrategies || <Form.Select data-testid={`${testid}-${formName}`} id={formName} {...register(formName, {
+  required: `${displayName} is required`
+})} defaultValue={initialValue}>
+          {healthUpdateStrategies.strategies.map(strategy => <option key={strategy.name} value={strategy.name} title={strategy.description}>
+              {strategy.displayName}
+            </option>)}
+        </Form.Select>}
 
     </Form.Group>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'strategies')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:17:8
   return (
     <Form.Group className="mb-3">
       <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          data-testid={`${testid}-${formName}`}
-          id={formName}
-          {...register(formName, {required: `${displayName} is required`})}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
+      {true}
 
     </Form.Group>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] ObjectLiteral
main/components/Commons/CommonsForm.js:21:34
         <Form.Select
           data-testid={`${testid}-${formName}`}
           id={formName}
-          {...register(formName, {required: `${displayName} is required`})}
+          {...register(formName, {})}
           defaultValue={initialValue}
         >
