[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:16:8
   return (
     <Form.Group className="mb-3">
       <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          // test id omitted since it is not currently used in tests, and makes stryker fail otherwise
-          // data-testid={`${testid}-${formName}`}
-          id={formName}
-          // "required" option is not necessary, since dropdown will always have a value
-          {...register(formName)}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
+      {false}
 
     </Form.Group>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
