[Killed] BlockStatement
main/components/Commons/FarmStats.js:5:38
 import { Card } from "react-bootstrap";
 import { ProgressBar } from "react-bootstrap";
 
-const FarmStats = ({userCommons}) => {
-    return (
-        <Card>
-        <Card.Header as="h5">Your Farm Stats</Card.Header>
-        <Card.Body>
-            {/* update total wealth and cow health with data from fixture */}
-            <Card.Title className="text-center">
-                💰 Total Wealth: ${userCommons.totalWealth.toFixed(2)}
-            </Card.Title>
-            <Card.Title className="text-center">
-                ❤️ Cow Health: {Math.round(userCommons.cowHealth*100)/100}%
-            </Card.Title>
-            <ProgressBar now={userCommons.cowHealth} min={0} max={100} variant="danger" />
-        </Card.Body>
-        </Card>
-    ); 
-}; 
+const FarmStats = ({userCommons}) => {}; 
 
 export default FarmStats; 
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: FarmStats(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
