[Killed] BlockStatement
main/components/Commons/FarmStats.js:6:38
 import Health from "./../../../assets/Health.png";
 import Cash from "./../../../assets/Cash.png";
 
-const FarmStats = ({userCommons}) => {
-    return (
-        <Card>
-        <Card.Header as="h5">Your Farm Stats</Card.Header>
-        <Card.Body>
-            {/* update total wealth and cow health with data from fixture */}
-            <Card.Text>
-                <img className="icon" src={Cash} alt="Cash"></img>
-            </Card.Text>
-            <Card.Text>
-                Total Wealth: ${userCommons.totalWealth}
-            </Card.Text>
-            <Card.Text>
-                <img className="icon" src={Health} alt="Health"></img> 
-            </Card.Text>
-            <Card.Text>
-                Cow Health: {Math.round(userCommons.cowHealth*100)/100}%
-            </Card.Text>
-        </Card.Body>
-        </Card>
-    ); 
-}; 
+const FarmStats = ({userCommons}) => {}; 
 
 export default FarmStats; 
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: FarmStats(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
