[Killed] OptionalChaining
main/components/Commons/ManageCows.js:15:47
             {/* change $10 to info from fixture */}
             <Card.Title>Market Cow Price: ${commons?.cowPrice}</Card.Title>
             <Card.Title>Number of Cows: {userCommons.numOfCows}</Card.Title>
-            <Card.Title>Current Milk Price: ${commons?.milkPrice}</Card.Title>
+            <Card.Title>Current Milk Price: ${commons.milkPrice}</Card.Title>
                 <Row>
                     <Col>
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'milkPrice')

[Killed] BlockStatement
main/components/Commons/ManageCows.js:26:71
                         <Button variant="outline-danger" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons)}} data-testid={"sell-cow-button"}>Sell cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"sell-cow-button"}>Sell cow</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Commons/ManageCows.js:26:107
                         <Button variant="outline-danger" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons)}} data-testid={"sell-cow-button"}>Sell cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons)}} data-testid={""}>Sell cow</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click buy and sell buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="sell-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
