[Survived] StringLiteral
main/components/Jobs/SetCowHealthForm.js:37:14
   const handleCommonsSelection = (id, name) => {
     setSelectedCommons(id);
     setSelectedCommonsName(name);
-    setValue("selectedCommons", id); // Update the form value for selectedCommons
+    setValue("", id); // Update the form value for selectedCommons
   };
 

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.js:41:27
   };
 
   const onSubmit = () => {
-    if (!selectedCommons) {
-      setShowCommonsError(true);
-      return;
-    }
+    if (!selectedCommons) {}
     const params= { selectedCommons, healthValue, selectedCommonsName };
     submitAction(params);
killedBy: SetCowHealthForm tests can show error messages when user doesn't select commons
statusReason: Error: Unable to find an element with the text: /Please select a commons./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Jobs/SetCowHealthForm.js:45:19
       setShowCommonsError(true);
       return;
     }
-    const params= { selectedCommons, healthValue, selectedCommonsName };
+    const params= {};
     submitAction(params);
   };
killedBy: SetCowHealthForm tests user can sucessfully submit the job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "healthValue": "10",
-   "selectedCommons": 1,

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.js:90:24
           step="1"
           value={healthValue}
           isInvalid={!!errors.healthValue}
-          {...register("healthValue", {
+          {...register("", {
             valueAsNumber: true,
             required: "healthValue is required",
killedBy: AdminJobsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
