[Killed] BlockStatement
main/components/Commons/CommonsForm.js:11:4
   initialValue,
   healthUpdateStrategies,
   register,
-}) {
-  return (
-    <Form.Group className="mb-3">
-      <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          // test id omitted since it is not currently used in tests, and makes stryker fail otherwise
-          // data-testid={`${testid}-${formName}`}
-          id={formName}
-          // "required" option is not necessary, since dropdown will always have a value
-          {...register(formName)}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
-
-    </Form.Group>
-  );
-}
+}) {}
 
 
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: HealthUpdateStrategiesDropdown(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:15:8
   return (
     <Form.Group className="mb-3">
       <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          // test id omitted since it is not currently used in tests, and makes stryker fail otherwise
-          // data-testid={`${testid}-${formName}`}
-          id={formName}
-          // "required" option is not necessary, since dropdown will always have a value
-          {...register(formName)}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
+      {true}
 
     </Form.Group>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:15:8
   return (
     <Form.Group className="mb-3">
       <Form.Label htmlFor={formName}>{displayName}</Form.Label>
-      {healthUpdateStrategies && (
-        <Form.Select
-          // test id omitted since it is not currently used in tests, and makes stryker fail otherwise
-          // data-testid={`${testid}-${formName}`}
-          id={formName}
-          // "required" option is not necessary, since dropdown will always have a value
-          {...register(formName)}
-          defaultValue={initialValue}
-        >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
-        </Form.Select>
-      )}
+      {healthUpdateStrategies || <Form.Select
+// test id omitted since it is not currently used in tests, and makes stryker fail otherwise
+// data-testid={`${testid}-${formName}`}
+id={formName}
+// "required" option is not necessary, since dropdown will always have a value
+{...register(formName)} defaultValue={initialValue}>
+          {healthUpdateStrategies.strategies.map(strategy => <option key={strategy.name} value={strategy.name} title={strategy.description}>
+              {strategy.displayName}
+            </option>)}
+        </Form.Select>}
 
     </Form.Group>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'strategies')

[Killed] ArrowFunction
main/components/Commons/CommonsForm.js:24:50
           {...register(formName)}
           defaultValue={initialValue}
         >
-          {healthUpdateStrategies.strategies.map((strategy) => (
-            <option key={strategy.name} value={strategy.name} title={strategy.description}>
-              {strategy.displayName}
-            </option>
-          ))}
+          {healthUpdateStrategies.strategies.map(() => undefined)}
         </Form.Select>
       )}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(strat1)

Expected the element to have value:
  strat1
Received:
  undefined
