[Killed] ConditionalExpression
main/components/Commons/CommonsList.js:34:17
                 </Container>
             </Card.Subtitle>
             {
-                props.commonList &&
-                props.commonList.map(
-                    (c) => (<CommonsCard key={c.id} commons={c} buttonText={props.buttonText} buttonLink={props.buttonLink} />)
-                )
+                false
             }
         </Card>
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(HomePageBackground.jpg);"
    >
      <div

[Killed] ConditionalExpression
main/components/Commons/CommonsList.js:34:17
                 </Container>
             </Card.Subtitle>
             {
-                props.commonList &&
-                props.commonList.map(
-                    (c) => (<CommonsCard key={c.id} commons={c} buttonText={props.buttonText} buttonLink={props.buttonLink} />)
-                )
+                true
             }
         </Card>
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(HomePageBackground.jpg);"
    >
      <div

[Killed] ArrowFunction
main/components/Commons/CommonsList.js:36:21
             {
                 props.commonList &&
                 props.commonList.map(
-                    (c) => (<CommonsCard key={c.id} commons={c} buttonText={props.buttonText} buttonLink={props.buttonLink} />)
+                    () => undefined
                 )
             }
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(HomePageBackground.jpg);"
    >
      <div
