[Killed] BlockStatement
main/components/Commons/CommonsPlay.js:3:54
 import React from "react";
 
-export default function CommonsPlay({ currentUser }) {
-  // Stryker disable next-line OptionalChaining : too many cases to test for too little value
-  const firstName = currentUser?.root ? currentUser?.root?.user?.givenName : "";
-  return (
-    <div data-testid="CommonsPlay">
-      <h1>
-        Welcome Farmer {firstName}
-      </h1>
-    </div>
-  );
-};
+export default function CommonsPlay({ currentUser }) {};
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: CommonsPlay(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
