[Killed] BlockStatement
main/components/Commons/CommonsTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/admin/editcommons/${cell.row.values["commons.id"]}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminListCommonPage tests what happens when you click edit as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/editcommons/1"

Number of calls: 0

<html>
  <head />
