[Killed] BlockStatement
main/components/Commons/Profits.js:8:34
 import { timestampToDate } from "main/utils/dateUtils";
 
 
-const Profits = ({ profits }) => {
-    const profitsForTable =
-        profits ?
-        profits.map(profit => ({
-            date: timestampToDate(profit.timestamp),
-            ...profit
-        })) : 
-        // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
-        [];
-        profitsForTable.reverse();
-    return (
-        <Card>
-            <Card.Header as="h5">
-                Profits
-            </Card.Header>
-            <Card.Body>
-                {/* change 4am to admin-appointed time? And consider adding milk bottle as decoration */}
-                <Card.Title>
-                    You will earn profits from milking your cows everyday at 4am.
-                </Card.Title>
-                <ProfitsTable profits={profitsForTable} />
-            </Card.Body>
-        </Card>
-    );
-};
+const Profits = ({ profits }) => {};
 
 export default Profits;
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: Profits(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
main/components/Commons/Profits.js:11:21
 const Profits = ({ profits }) => {
     const profitsForTable =
         profits ?
-        profits.map(profit => ({
-            date: timestampToDate(profit.timestamp),
-            ...profit
-        })) : 
+        profits.map(() => undefined) : 
         // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
         [];
killedBy: Profits tests renders properly when profits is non-empty
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] ObjectLiteral
main/components/Commons/Profits.js:11:32
 const Profits = ({ profits }) => {
     const profitsForTable =
         profits ?
-        profits.map(profit => ({
-            date: timestampToDate(profit.timestamp),
-            ...profit
-        })) : 
+        profits.map(profit => ({})) : 
         // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
         [];
killedBy: Profits tests renders properly when profits is non-empty
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] MethodExpression
main/components/Commons/Profits.js:17:9
         })) : 
         // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
         [];
-        profitsForTable.reverse();
+        profitsForTable;
     return (
         <Card>
killedBy: Profits tests renders properly when profits is non-empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /52.80/
Received:
  $58.20
