[Killed] ArrowFunction
main/components/Commons/ProfitsTable.js:7:43
 export default function ProfitsTable({ profits }) {
     
     // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
-    const memoizedColumns = React.useMemo(() => 
-        [
-            {
-                Header: "Profit",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
-            },
-            {
-                Header: "Date",
-                accessor: "date",
-            },
-            {
-                Header: "Health",
-                accessor: (row) => `${row.avgCowHealth + '%'}`
-            },
-            {
-                Header: "Cows",
-                accessor: "numCows",
-            },
-        ], 
+    const memoizedColumns = React.useMemo(() => undefined, 
     []);
     const memoizedDates = React.useMemo(() => profits, [profits]);
killedBy: Profits tests renders properly for empty profits array
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.js:9:13
     // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
     const memoizedColumns = React.useMemo(() => 
         [
-            {
-                Header: "Profit",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
-            },
+            {},
             {
                 Header: "Date",
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/ProfitsTable.js:11:27
         [
             {
                 Header: "Profit",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
+                accessor: () => undefined,
             },
             {
killedBy: Profits tests renders properly when profits is non-empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /52.80/
Received:

[Killed] StringLiteral
main/components/Commons/ProfitsTable.js:11:36
         [
             {
                 Header: "Profit",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
+                accessor: (row) => ``,
             },
             {
killedBy: Profits tests renders properly when profits is non-empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /52.80/
Received:

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.js:13:13
                 Header: "Profit",
                 accessor: (row) => `$${row.amount.toFixed(2)}`,
             },
-            {
-                Header: "Date",
-                accessor: "date",
-            },
+            {},
             {
                 Header: "Health",
killedBy: Profits tests renders properly for empty profits array
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/ProfitsTable.js:15:27
             },
             {
                 Header: "Date",
-                accessor: "date",
+                accessor: "",
             },
             {
killedBy: Profits tests renders properly when profits is non-empty
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ProfitsTable-cell-row-0-col-date"]

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.js:17:13
                 Header: "Date",
                 accessor: "date",
             },
-            {
-                Header: "Health",
-                accessor: (row) => `${row.avgCowHealth + '%'}`
-            },
+            {},
             {
                 Header: "Cows",
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/ProfitsTable.js:18:25
                 accessor: "date",
             },
             {
-                Header: "Health",
+                Header: "",
                 accessor: (row) => `${row.avgCowHealth + '%'}`
             },
killedBy: Profits tests renders properly for empty profits array
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/ProfitsTable.js:19:27
             },
             {
                 Header: "Health",
-                accessor: (row) => `${row.avgCowHealth + '%'}`
+                accessor: () => undefined
             },
             {
killedBy: Profits tests renders properly when profits is non-empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /88%/
Received:

[Killed] StringLiteral
main/components/Commons/ProfitsTable.js:19:58
             },
             {
                 Header: "Health",
-                accessor: (row) => `${row.avgCowHealth + '%'}`
+                accessor: (row) => `${row.avgCowHealth + ""}`
             },
             {
killedBy: Profits tests renders properly when profits is non-empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /88%/
Received:
  88

[Killed] ArrowFunction
main/components/Commons/ProfitsTable.js:27:41
             },
         ], 
     []);
-    const memoizedDates = React.useMemo(() => profits, [profits]);
+    const memoizedDates = React.useMemo(() => undefined, [profits]);
     // Stryker enable ArrayDeclaration
 
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')
