[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/commons`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find a label with the text of: /Commons Name/

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/AdminEditCommonsPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-        "name": commons.name,
-        "startingBalance": commons.startingBalance,
-        "cowPrice": commons.cowPrice,
-        "milkPrice": commons.milkPrice,
-        "startingDate": commons.startingDate,
-        "degradationRate": commons.degradationRate,
-        "carryingCapacity": commons.carryingCapacity,
-        "aboveCapacityHealthUpdateStrategy": commons.aboveCapacityHealthUpdateStrategy,
-        "belowCapacityHealthUpdateStrategy": commons.belowCapacityHealthUpdateStrategy,
-        "showLeaderboard": commons.showLeaderboard,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.js:25:48
     );
 
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-        "name": commons.name,
-        "startingBalance": commons.startingBalance,
-        "cowPrice": commons.cowPrice,
-        "milkPrice": commons.milkPrice,
-        "startingDate": commons.startingDate,
-        "degradationRate": commons.degradationRate,
-        "carryingCapacity": commons.carryingCapacity,
-        "aboveCapacityHealthUpdateStrategy": commons.aboveCapacityHealthUpdateStrategy,
-        "belowCapacityHealthUpdateStrategy": commons.belowCapacityHealthUpdateStrategy,
-        "showLeaderboard": commons.showLeaderboard,
-    }
-  });
+  const objectToAxiosPutParams = (commons) => ({});
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminEditCommonsPage.js:45:37
     }
   });
 
-  const onSuccess = (_, commons) => {
-    toast(`Commons Updated - id: ${commons.id} name: ${commons.name}`);
-  }
+  const onSuccess = (_, commons) => {}
 
   const mutation = useBackendMutation(
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminEditCommonsPage.js:62:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/admin/listcommons" />
-  }
+  if (isSuccess) {}
 
   return (
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/admin/listcommons"}

Number of calls: 0

[Killed] ConditionalExpression
src/main/pages/AdminEditCommonsPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit  Commons</h1>
-        {commons &&
-          <CommonsForm initialCommons={commons} submitAction={submitAction} buttonLabel="Update" />
+        {true
         }
       </div>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find a label with the text of: /Commons Name/

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
src/main/pages/AdminEditCommonsPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit  Commons</h1>
-        {commons &&
-          <CommonsForm initialCommons={commons} submitAction={submitAction} buttonLabel="Update" />
+        {commons || <CommonsForm initialCommons={commons} submitAction={submitAction} buttonLabel="Update" />
         }
       </div>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
