[Killed] BlockStatement
src/main/pages/AdminListCommonPage.js:8:1
 import { useCurrentUser } from "main/utils/currentUser";
 
 export default function AdminListCommonsPage()
-{
-  const { data: currentUser } = useCurrentUser();
-
-  // Stryker disable  all 
-  const { data: commons, error: _error, status: _status } =
-    useBackend(
-      ["/api/commons/allplus"],
-      { method: "GET", url: "/api/commons/allplus" },
-      []
-    );
-  // Stryker enable  all 
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>List Commons</h1>
-        <CommonsTable commons={commons} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-};
+{};
 
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: AdminListCommonsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
