[Killed] BlockStatement
src/main/pages/PlayPage.js:64:30
   // Stryker restore all 
 
 
-  const onSuccessBuy = () => {
-    toast(`Cow bought!`);
-  }
+  const onSuccessBuy = () => {}
 
   // Stryker disable all (can't check if commonsId is null because it is mocked)
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cow bought!"

Number of calls: 0

[Killed] BlockStatement
src/main/pages/PlayPage.js:90:34
   // Stryker restore all 
 
 
-  const onBuy = (userCommons) => {
-    mutationbuy.mutate(userCommons)
-  };
+  const onBuy = (userCommons) => {};
 
 
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/PlayPage.js:95:31
   };
 
 
-  const onSuccessSell = () => {
-    toast(`Cow sold!`);
-  }
+  const onSuccessSell = () => {}
 
   // Stryker disable all 
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cow sold!"
Received: "Cow bought!"

Number of calls: 1

[Killed] BlockStatement
src/main/pages/PlayPage.js:120:35
   // Stryker restore all 
 
 
-  const onSell = (userCommons) => {
-    mutationsell.mutate(userCommons)
-  };
+  const onSell = (userCommons) => {};
 
   return (
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/PlayPage.js:125:61
   };
 
   return (
-    <div style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }} data-testid="playpage-div">
+    <div style={{ backgroundSize: 'cover', backgroundImage: `` }} data-testid="playpage-div">
       <BasicLayout >
         <Container >
killedBy: PlayPage tests Make sure div has correct attributes
statusReason: Error: expect(element).toHaveAttribute("style", StringContaining "background-size: cover; background-image: url(PlayPageBackground.png);") // element.getAttribute("style") === StringContaining "background-size: cover; background-image: url(PlayPageBackground.png);"

Expected the element to have attribute:
  style=StringContaining "background-size: cover; background-image: url(PlayPageBackground.pn

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:125:17
   };
 
   return (
-    <div style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }} data-testid="playpage-div">
+    <div style={{}} data-testid="playpage-div">
       <BasicLayout >
         <Container >
killedBy: PlayPage tests Make sure div has correct attributes
statusReason: Error: expect(element).toHaveAttribute("style", StringContaining "background-size: cover; background-image: url(PlayPageBackground.png);") // element.getAttribute("style") === StringContaining "background-size: cover; background-image: url(PlayPageBackground.png);"

Expected the element to have attribute:
  style=StringContaining "background-size: cover; background-image: url(PlayPageBackground.pn

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:128:13
     <div style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }} data-testid="playpage-div">
       <BasicLayout >
         <Container >
-          {!!currentUser && <CommonsPlay currentUser={currentUser} />}
+          {!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Welcome Farmer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] LogicalOperator
src/main/pages/PlayPage.js:128:12
     <div style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }} data-testid="playpage-div">
       <BasicLayout >
         <Container >
-          {!!currentUser && <CommonsPlay currentUser={currentUser} />}
+          {!!currentUser || <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Welcome Farmer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:129:12
       <BasicLayout >
         <Container >
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-          {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
+          {false}
           <br />
           {!!userCommons && !!commonsPlus &&
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] LogicalOperator
src/main/pages/PlayPage.js:129:12
       <BasicLayout >
         <Container >
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-          {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
+          {!!commonsPlus || <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
           {!!userCommons && !!commonsPlus &&
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:131:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
-          {!!userCommons && !!commonsPlus &&
+          {!userCommons && !!commonsPlus &&
             <CardGroup >
               <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: TypeError: Cannot read properties of undefined (reading 'numOfCows')

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:131:30
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
-          {!!userCommons && !!commonsPlus &&
+          {!!userCommons && !commonsPlus &&
             <CardGroup >
               <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
