[Killed] BlockStatement
src/main/utils/useBackend.js:56:93
     return await (await axios(params)).data;
 };
 
-export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {
-    const queryClient = useQueryClient();
-
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (error) => {
-            // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-            if (error.response?.data?.message) {
-                toast.error(error.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-                toast.error(errorMessage);
-            }
-        },
-        // Stryker disable all : Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            if (queryKey !== null)
-                queryClient.invalidateQueries(queryKey);
-        },
-        // Stryker enable all
-        retry: false,
-        ...useMutationParams
-    })
-}
+export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {}
 
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')
