[Killed] ArithmeticOperator
main/components/Commons/FarmStats.js:21:33
                 Total Cows Sold: {userCommons.cowsSold}
             </Card.Text>
             <Card.Title className="text-center">
-                ❤️ Cow Health: {Math.round(userCommons.cowHealth*100)/100}%
+                ❤️ Cow Health: {Math.round(userCommons.cowHealth * 100) * 100}%
             </Card.Title>
             <ProgressBar now={userCommons.cowHealth} min={0} max={100} variant="danger" />
killedBy: FarmStats tests contains correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Cow Health: 98%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
main/components/Commons/FarmStats.js:21:44
                 Total Cows Sold: {userCommons.cowsSold}
             </Card.Text>
             <Card.Title className="text-center">
-                ❤️ Cow Health: {Math.round(userCommons.cowHealth*100)/100}%
+                ❤️ Cow Health: {Math.round(userCommons.cowHealth / 100)/100}%
             </Card.Title>
             <ProgressBar now={userCommons.cowHealth} min={0} max={100} variant="danger" />
killedBy: FarmStats tests contains correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Cow Health: 98%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5
