[Killed] BlockStatement
main/components/Commons/ManageCows.js:5:64
 import { Card, Button, Row, Col } from "react-bootstrap";
 
 // add parameters 
-const ManageCows = ({userCommons, commons, onBuy, onSell}) =>  {
-    // update cowPrice from fixture
-    return (
-        <Card>
-        <Card.Header as="h5">Manage Cows</Card.Header>
-        <Card.Body>
-            {/* change $10 to info from fixture */}
-            <Card.Title className="text-center">💵 Market Cow Price: ${commons?.cowPrice}</Card.Title>
-            <Card.Title className="text-center">🐮 Number of Cows: {userCommons.numOfCows}</Card.Title>
-            <Card.Title className="text-center">🥛 Current Milk Price: ${commons?.milkPrice}</Card.Title>
-            <Row>
-                <Col className="text-center">
-                    <Button variant="outline-success" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
-                </Col>
-                <Col className="text-center">
-                    <Button variant="outline-danger" onClick={()=>{onSell(userCommons)}} data-testid={"sell-cow-button"}>Sell cow</Button>
-                </Col>
-            </Row>
-                
-                    Note: Buying cows buys at current cow price, but selling cows sells at current cow price
-                    times the average health of cows as a percentage! 
-        </Card.Body>
-        </Card>
-    ); 
-}; 
+const ManageCows = ({userCommons, commons, onBuy, onSell}) =>  {}; 
 
 export default ManageCows; 
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: ManageCows(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] OptionalChaining
main/components/Commons/ManageCows.js:12:72
         <Card.Header as="h5">Manage Cows</Card.Header>
         <Card.Body>
             {/* change $10 to info from fixture */}
-            <Card.Title className="text-center">💵 Market Cow Price: ${commons?.cowPrice}</Card.Title>
+            <Card.Title className="text-center">💵 Market Cow Price: ${ccommons.cowPrice</Card.Title>
             <Card.Title className="text-center">🐮 Number of Cows: {userCommons.numOfCows}</Card.Title>
             <Card.Title className="text-center">🥛 Current Milk Price: ${commons?.milkPrice}</Card.Title>
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')

[Killed] OptionalChaining
main/components/Commons/ManageCows.js:14:74
             {/* change $10 to info from fixture */}
             <Card.Title className="text-center">💵 Market Cow Price: ${commons?.cowPrice}</Card.Title>
             <Card.Title className="text-center">🐮 Number of Cows: {userCommons.numOfCows}</Card.Title>
-            <Card.Title className="text-center">🥛 Current Milk Price: ${commons?.milkPrice}</Card.Title>
+            <Card.Title className="text-center">🥛 Current Milk Price: ${ccommons.milkPrice</Card.Title>
             <Row>
                 <Col className="text-center">
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'milkPrice')

[Killed] BlockStatement
main/components/Commons/ManageCows.js:17:68
             <Card.Title className="text-center">🥛 Current Milk Price: ${commons?.milkPrice}</Card.Title>
             <Row>
                 <Col className="text-center">
-                    <Button variant="outline-success" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
+                    <Button variant="outline-success" onClick={()=>{}} data-testid={"buy-cow-button"}>Buy cow</Button>
                 </Col>
                 <Col className="text-center">
killedBy: ManageCows tests buying and selling a cow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Commons/ManageCows.js:20:67
                     <Button variant="outline-success" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
                 </Col>
                 <Col className="text-center">
-                    <Button variant="outline-danger" onClick={()=>{onSell(userCommons)}} data-testid={"sell-cow-button"}>Sell cow</Button>
+                    <Button variant="outline-danger" onClick={()=>{}} data-testid={"sell-cow-button"}>Sell cow</Button>
                 </Col>
             </Row>
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

<html>
  <head />
  <body>
