[Killed] BlockStatement
main/components/Jobs/MilkCowsJobForm.js:4:44
 import { Button, Form } from "react-bootstrap";
 import { useForm } from "react-hook-form";
 
-function MilkTheCowsForm( {submitAction} ) {
-
-    // Stryker disable all
-    const {
-      handleSubmit,
-    } = useForm(
-    );
-    // Stryker enable all
-
-    return (
-      <Form onSubmit={handleSubmit(submitAction)}>
-        <p>Click this button to milk the cows across all commons!</p>
-        <Button type="submit" data-testid="MilkTheCowsForm-Submit-Button">Update</Button>
-    </Form>
-    );
-  }
+function MilkTheCowsForm( {submitAction} ) {}
   
   export default MilkTheCowsForm;
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: MilkTheCowsForm(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
