[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.js:6:49
 import {useForm} from "react-hook-form";
 import {useBackend} from "main/utils/useBackend";
 
-function SetCowHealthForm({submitAction, testid="SetCowHealthForm"}) {
+function SetCowHealthForm({submitAction, testid=""}) {
 
   const localHealthValue = localStorage.getItem(`${testid}-health`);
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: Unable to find an element by: [data-testid="SetCowHealthForm-commons-1"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/Jobs/SetCowHealthForm.js:9:50
 function SetCowHealthForm({submitAction, testid="SetCowHealthForm"}) {
 
   const localHealthValue = localStorage.getItem(`${testid}-health`);
-  const [healthValue, setHealthValue] = useState(localHealthValue || 100);
+  const [healthValue, setHealthValue] = useState(localHealthValue && 100);
 
   const {data: commons} = useBackend(
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.js:9:50
 function SetCowHealthForm({submitAction, testid="SetCowHealthForm"}) {
 
   const localHealthValue = localStorage.getItem(`${testid}-health`);
-  const [healthValue, setHealthValue] = useState(localHealthValue || 100);
+  const [healthValue, setHealthValue] = useState(false);
 
   const {data: commons} = useBackend(
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.js:13:13
 
   const {data: commons} = useBackend(
       ["/api/commons/all"],
-      {url: "/api/commons/all"},
+      {url: ""},
       []
   );
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: Unable to find an element by: [data-testid="SetCowHealthForm-commons-1"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] ObjectLiteral
main/components/Jobs/SetCowHealthForm.js:18:25
   );
   const [selectedCommons, setSelectedCommons] = useState(null);
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
-  const defaultValues = { selectedCommons: selectedCommons, healthValue };
+  const defaultValues = {};
 
   const {

[Survived] BooleanLiteral
main/components/Jobs/SetCowHealthForm.js:28:60
     formState: {errors},
   } = useForm({ defaultValues });
 
-  const [showCommonsError, setShowCommonsError] = useState(false);
+  const [showCommonsError, setShowCommonsError] = useState(true);
 
   const handleHealthValueChange = (e) => {

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.js:30:42
 
   const [showCommonsError, setShowCommonsError] = useState(false);
 
-  const handleHealthValueChange = (e) => {
-    const newValue = e.target.value;
-    setHealthValue(newValue);
-    localStorage.setItem(`${testid}-health`, newValue);
-  };
+  const handleHealthValueChange = (e) => {};
 
   const handleCommonsSelection = (id, name) => {
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
- Expected
+ Received

  "submitSetCowHealthJob",
  Object {

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.js:36:48
     localStorage.setItem(`${testid}-health`, newValue);
   };
 
-  const handleCommonsSelection = (id, name) => {
-    setSelectedCommons(id);
-    setSelectedCommonsName(name);
-    setValue("selectedCommons", id); // Update the form value for selectedCommons
-  };
+  const handleCommonsSelection = (id, name) => {};
 
   const onSubmit = () => {
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.js:42:26
     setValue("selectedCommons", id); // Update the form value for selectedCommons
   };
 
-  const onSubmit = () => {
-    if (!selectedCommons) {
-      setShowCommonsError(true);
-      return;
-    }
-    const params= { selectedCommons, healthValue, selectedCommonsName };
-    submitAction(params);
-  };
+  const onSubmit = () => {};
 
   return (
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.js:43:9
   };
 
   const onSubmit = () => {
-    if (!selectedCommons) {
+    if (true) {
       setShowCommonsError(true);
       return;
killedBy: SetCowHealthForm tests user can sucessfully submit the job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.js:43:9
   };
 
   const onSubmit = () => {
-    if (!selectedCommons) {
+    if (false) {
       setShowCommonsError(true);
       return;
killedBy: SetCowHealthForm tests can show error messages when user doesn't select commons
statusReason: Error: Unable to find an element with the text: /Please select a commons./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Jobs/SetCowHealthForm.js:44:27
 
   const onSubmit = () => {
     if (!selectedCommons) {
-      setShowCommonsError(true);
+      setShowCommonsError(false);
       return;
     }
killedBy: SetCowHealthForm tests can show error messages when user doesn't select commons
statusReason: Error: Unable to find an element with the text: /Please select a commons./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ArrowFunction
main/components/Jobs/SetCowHealthForm.js:65:24
           Commons
         </Form.Text>
         <div className="ms-3">
-          {commons.map((object) => (
-            <Form.Check
-              key={object.id}
-              type="radio"
-              label={object.name}
-              data-testid={`${testid}-commons-${object.id}`}
-              onChange={() => handleCommonsSelection(object.id, object.name)}
-              checked={selectedCommons === object.id}
-            />
-          ))}
+          {commons.map(() => undefined)}
         </div>
         {showCommonsError && (
killedBy: SetCowHealthForm tests user can sucessfully submit the job
statusReason: Error: Unable to find an element by: [data-testid="SetCowHealthForm-commons-1"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ArrowFunction
main/components/Jobs/SetCowHealthForm.js:71:25
               type="radio"
               label={object.name}
               data-testid={`${testid}-commons-${object.id}`}
-              onChange={() => handleCommonsSelection(object.id, object.name)}
+              onChange={() => undefined}
               checked={selectedCommons === object.id}
             />
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] EqualityOperator
main/components/Jobs/SetCowHealthForm.js:72:24
               label={object.name}
               data-testid={`${testid}-commons-${object.id}`}
               onChange={() => handleCommonsSelection(object.id, object.name)}
-              checked={selectedCommons === object.id}
+              checked={selectedCommons !== object.id}
             />
           ))}
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.js:72:24
               label={object.name}
               data-testid={`${testid}-commons-${object.id}`}
               onChange={() => handleCommonsSelection(object.id, object.name)}
-              checked={selectedCommons === object.id}
+              checked={true}
             />
           ))}
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.js:76:10
             />
           ))}
         </div>
-        {showCommonsError && (
-          <Form.Text className="text-danger">
-            Please select a commons.
-          </Form.Text>
-        )}
+        {false}
       </Form.Group>
 
killedBy: SetCowHealthForm tests can show error messages when user doesn't select commons
statusReason: Error: Unable to find an element with the text: /Please select a commons./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.js:76:10
             />
           ))}
         </div>
-        {showCommonsError && (
-          <Form.Text className="text-danger">
-            Please select a commons.
-          </Form.Text>
-        )}
+        {true}
       </Form.Group>
 
killedBy: SetCowHealthForm tests can show error messages when user doesn't select commons
statusReason: Error: Unable to find an element with the text: /Please select a commons./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.js:86:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="healthValue">Health [0-100]</Form.Label>
         <Form.Control
-          data-testid={`${testid}-healthValue`}
+          data-testid={``}
           id="healthValue"
           type="number"
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SetCowHealthForm-healthValue"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] BooleanLiteral
main/components/Jobs/SetCowHealthForm.js:91:22
           type="number"
           step="1"
           value={healthValue}
-          isInvalid={!!errors.healthValue}
+          isInvalid={!errors.healthValue}
           {...register("healthValue", {
             valueAsNumber: true,

[Survived] BooleanLiteral
main/components/Jobs/SetCowHealthForm.js:93:28
           value={healthValue}
           isInvalid={!!errors.healthValue}
           {...register("healthValue", {
-            valueAsNumber: true,
+            valueAsNumber: false,
             required: "healthValue is required",
             min: {value: 0, message: "Health Value must be ≥ 0"},

[Survived] StringLiteral
main/components/Jobs/SetCowHealthForm.js:94:23
           isInvalid={!!errors.healthValue}
           {...register("healthValue", {
             valueAsNumber: true,
-            required: "healthValue is required",
+            required: "",
             min: {value: 0, message: "Health Value must be ≥ 0"},
             max: {value: 100, message: "Health Value must be ≤ 100"},

[Killed] OptionalChaining
main/components/Jobs/SetCowHealthForm.js:101:12
           onChange={handleHealthValueChange}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.healthValue?.message}
+          {errors.healthValue.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: SetCowHealthForm tests renders correctly with the right defaults
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
