[Killed] BlockStatement
main/components/Jobs/UpdateCowHealthForm.js:4:48
 import { Button, Form } from "react-bootstrap";
 import { useForm } from "react-hook-form";
 
-function UpdateCowHealthForm( {submitAction} ) {
-
-    // Stryker disable all
-    const {
-      handleSubmit,
-    } = useForm(
-    );
-    // Stryker enable all
-
-    return (
-      <Form onSubmit={handleSubmit(submitAction)}>
-        <p>Click this button to update cows' health in all commons!</p>
-        <Button type="submit" data-testid="UpdateCowHealthForm-Submit-Button">Update</Button>
-    </Form>
-    );
-  }
+function UpdateCowHealthForm( {submitAction} ) {}
   
   export default UpdateCowHealthForm;
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: UpdateCowHealthForm(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
