[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:16:9
             Header: 'Username',
             accessor: 'username', 
         },
-        {
-            Header: 'Total Wealth',
-            accessor: 'totalWealth',
-        },
+        {},
         {
             Header: 'Cows Owned',
killedBy: LeaderboardPage tests renders leaderboard for users when showLeaderboard = true
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:18:23
         },
         {
             Header: 'Total Wealth',
-            accessor: 'totalWealth',
+            accessor: "",
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-totalWealth"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:24:9
             Header: 'Cows Owned',
             accessor: 'numOfCows', 
         },
-        {
-            Header: 'Cow Health',
-            accessor: 'cowHealth', 
-        },
+        {},
         {
             Header: 'Cows Bought',
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:32:9
             Header: 'Cows Bought',
             accessor: 'cowsBought', 
         },
-        {
-            Header: 'Cows Sold',
-            accessor: 'cowsSold', 
-        },
+        {},
         {
             Header: 'Cow Deaths',
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:36:9
             Header: 'Cows Sold',
             accessor: 'cowsSold', 
         },
-        {
-            Header: 'Cow Deaths',
-            accessor: 'cowDeaths', 
-        },
+        {},
     ];
 
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrayDeclaration
main/components/Leaderboard/LeaderboardTable.js:46:28
 
     /* Temp filler for admin leaderboard table */
 
-    const columnsIfAdmin = [
-        {
-            Header: '(Admin) userCommons Id',
-            accessor: 'id'
-        },
-        ...columns
-
-    ];
+    const columnsIfAdmin = [];
 
     const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN") ? columnsIfAdmin : columns;
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: (Admin) userCommons Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; dis

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:47:9
     /* Temp filler for admin leaderboard table */
 
     const columnsIfAdmin = [
-        {
-            Header: '(Admin) userCommons Id',
-            accessor: 'id'
-        },
+        {},
         ...columns
 
killedBy: LeaderboardTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:49:23
     const columnsIfAdmin = [
         {
             Header: '(Admin) userCommons Id',
-            accessor: 'id'
+            accessor: ""
         },
         ...columns
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
