[Killed] BlockStatement
src/main/components/UserProfileTable.js:45:33
     );
 }
 
-function commonsString(commons) {
-    var result = "";
-
-    if (commons !== undefined) {
-        for (var i = 0; i < commons.length; i++) {
-            result += commons[i].name + ", ";
-        }
-        result = result.substring(0, result.length - 2);
-    }
-
-    return result;
-}
+function commonsString(commons) {}
killedBy: UserProfileTable tests renders a table with user info
statusReason: TestingLibraryElementError: Unable to find an element with the text: Commons 1, Commons 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
    >
      <thread>

[Killed] StringLiteral
src/main/components/UserProfileTable.js:46:18
 }
 
 function commonsString(commons) {
-    var result = "";
+    var result = "Stryker was here!";
 
     if (commons !== undefined) {
killedBy: UserProfileTable tests renders an empty table without crashing
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td>Stryker was here!</td> instead

[Killed] ConditionalExpression
src/main/components/UserProfileTable.js:48:9
 function commonsString(commons) {
     var result = "";
 
-    if (commons !== undefined) {
+    if (false) {
         for (var i = 0; i < commons.length; i++) {
             result += commons[i].name + ", ";
killedBy: UserProfileTable tests renders a table with user info
statusReason: TestingLibraryElementError: Unable to find an element with the text: Commons 1, Commons 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
    >
      <thread>

[Killed] ConditionalExpression
src/main/components/UserProfileTable.js:48:9
 function commonsString(commons) {
     var result = "";
 
-    if (commons !== undefined) {
+    if (true) {
         for (var i = 0; i < commons.length; i++) {
             result += commons[i].name + ", ";
killedBy: UserProfileTable tests renders an empty table without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/main/components/UserProfileTable.js:49:25
     var result = "";
 
     if (commons !== undefined) {
-        for (var i = 0; i < commons.length; i++) {
+        for (var i = 0; false; i++) {
             result += commons[i].name + ", ";
         }
killedBy: UserProfileTable tests renders a table with user info
statusReason: TestingLibraryElementError: Unable to find an element with the text: Commons 1, Commons 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
    >
      <thread>

[Killed] EqualityOperator
src/main/components/UserProfileTable.js:49:25
     var result = "";
 
     if (commons !== undefined) {
-        for (var i = 0; i < commons.length; i++) {
+        for (var i = 0; i <= commons.length; i++) {
             result += commons[i].name + ", ";
         }
killedBy: UserProfileTable tests renders a table with user info
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] AssignmentOperator
src/main/components/UserProfileTable.js:50:13
 
     if (commons !== undefined) {
         for (var i = 0; i < commons.length; i++) {
-            result += commons[i].name + ", ";
+            result -= commons[i].name + ", ";
         }
         result = result.substring(0, result.length - 2);
killedBy: UserProfileTable tests renders a table with user info
statusReason: TypeError: result.substring is not a function

[Killed] StringLiteral
src/main/components/UserProfileTable.js:50:41
 
     if (commons !== undefined) {
         for (var i = 0; i < commons.length; i++) {
-            result += commons[i].name + ", ";
+            result += commons[i].name + "";
         }
         result = result.substring(0, result.length - 2);
killedBy: UserProfileTable tests renders a table with user info
statusReason: TestingLibraryElementError: Unable to find an element with the text: Commons 1, Commons 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
    >
      <thread>

[Killed] ArithmeticOperator
src/main/components/UserProfileTable.js:52:38
         for (var i = 0; i < commons.length; i++) {
             result += commons[i].name + ", ";
         }
-        result = result.substring(0, result.length - 2);
+        result = result.substring(0, result.length + 2);
     }
 
killedBy: UserProfileTable tests renders a table with user info
statusReason: TestingLibraryElementError: Unable to find an element with the text: Commons 1, Commons 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
    >
      <thread>

[Killed] MethodExpression
src/main/components/UserProfileTable.js:52:18
         for (var i = 0; i < commons.length; i++) {
             result += commons[i].name + ", ";
         }
-        result = result.substring(0, result.length - 2);
+        result = result;
     }
 
killedBy: UserProfileTable tests renders a table with user info
statusReason: TestingLibraryElementError: Unable to find an element with the text: Commons 1, Commons 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
    >
      <thread>
