[Killed] BlockStatement
src/main/utils/commonsUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/commons",
-        method: "DELETE",
-        params: {
-            id: cell.row.values["commons.id"]
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Commons with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/commonsUtils.js:12:17
     return {
         url: "/api/commons",
         method: "DELETE",
-        params: {
-            id: cell.row.values["commons.id"]
-        }
+        params: {}
     }
 }
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Commons with id 1 was deleted"

Number of calls: 0

<html>
  <head />
