[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:2:90
 
-export function sortByWealth(userCommonsArray, returnArraySize = userCommonsArray.length){
-  return userCommonsArray.sort((a, b) => {
-    return b.totalWealth - a.totalWealth;
-  }).slice(0, returnArraySize);
-}
+export function sortByWealth(userCommonsArray, returnArraySize = userCommonsArray.length){}
 
 export function sortByNumCows(userCommonsArray, returnArraySize = userCommonsArray.length){
killedBy: leaderboardSortingUtils tests sortByWealth
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:3:10
 
 export function sortByWealth(userCommonsArray, returnArraySize = userCommonsArray.length){
-  return userCommonsArray.sort((a, b) => {
-    return b.totalWealth - a.totalWealth;
-  }).slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {
+  return b.totalWealth - a.totalWealth;
+});
 }
 
killedBy: leaderboardSortingUtils tests sortByWealthReturnOne
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 10

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:3:10
 
 export function sortByWealth(userCommonsArray, returnArraySize = userCommonsArray.length){
-  return userCommonsArray.sort((a, b) => {
-    return b.totalWealth - a.totalWealth;
-  }).slice(0, returnArraySize);
+  return userCommonsArray.slice(0, returnArraySize);
 }
 
killedBy: leaderboardSortingUtils tests sortByWealth
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100000
Received: 1000

[Killed] ArithmeticOperator
src/main/utils/leaderboardSortingUtils.js:4:12
 
 export function sortByWealth(userCommonsArray, returnArraySize = userCommonsArray.length){
   return userCommonsArray.sort((a, b) => {
-    return b.totalWealth - a.totalWealth;
+    return b.totalWealth + a.totalWealth;
   }).slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByWealth
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100000
Received: 1000

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:8:91
   }).slice(0, returnArraySize);
 }
 
-export function sortByNumCows(userCommonsArray, returnArraySize = userCommonsArray.length){
-  return userCommonsArray.sort((a, b) => {
-    return b.numOfCows - a.numOfCows;
-  }).slice(0, returnArraySize);
-}
+export function sortByNumCows(userCommonsArray, returnArraySize = userCommonsArray.length){}
 
 export function sortByCowHealth(userCommonsArray, returnArraySize = userCommonsArray.length){
killedBy: leaderboardSortingUtils tests sortByNumCows
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:9:42
 }
 
 export function sortByNumCows(userCommonsArray, returnArraySize = userCommonsArray.length){
-  return userCommonsArray.sort((a, b) => {
-    return b.numOfCows - a.numOfCows;
-  }).slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {}).slice(0, returnArraySize);
 }
 
killedBy: leaderboardSortingUtils tests sortByNumCows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 8

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:9:10
 }
 
 export function sortByNumCows(userCommonsArray, returnArraySize = userCommonsArray.length){
-  return userCommonsArray.sort((a, b) => {
-    return b.numOfCows - a.numOfCows;
-  }).slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {
+  return b.numOfCows - a.numOfCows;
+});
 }
 
killedBy: leaderboardSortingUtils tests sortByNumCowsReturnOne
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 10

[Killed] ArithmeticOperator
src/main/utils/leaderboardSortingUtils.js:10:12
 
 export function sortByNumCows(userCommonsArray, returnArraySize = userCommonsArray.length){
   return userCommonsArray.sort((a, b) => {
-    return b.numOfCows - a.numOfCows;
+    return b.numOfCows + a.numOfCows;
   }).slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByNumCows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 8

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:14:93
   }).slice(0, returnArraySize);
 }
 
-export function sortByCowHealth(userCommonsArray, returnArraySize = userCommonsArray.length){
-  //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
-  return userCommonsArray.sort((a, b) => {
-    return b.cowHealth - a.cowHealth;
-  }).slice(0, returnArraySize);
-}
+export function sortByCowHealth(userCommonsArray, returnArraySize = userCommonsArray.length){}
 
killedBy: leaderboardSortingUtils tests sortByCowHealth
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/main/utils/leaderboardSortingUtils.js:16:42
 
 export function sortByCowHealth(userCommonsArray, returnArraySize = userCommonsArray.length){
   //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
-  return userCommonsArray.sort((a, b) => {
-    return b.cowHealth - a.cowHealth;
-  }).slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {}).slice(0, returnArraySize);
 }
 
killedBy: leaderboardSortingUtils tests sortByCowHealth
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 98
Received: 2

[Killed] MethodExpression
src/main/utils/leaderboardSortingUtils.js:16:10
 
 export function sortByCowHealth(userCommonsArray, returnArraySize = userCommonsArray.length){
   //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
-  return userCommonsArray.sort((a, b) => {
-    return b.cowHealth - a.cowHealth;
-  }).slice(0, returnArraySize);
+  return userCommonsArray.sort((a, b) => {
+  return b.cowHealth - a.cowHealth;
+});
 }
 
killedBy: leaderboardSortingUtils tests sortByCowHealthReturnOne
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 10

[Killed] ArithmeticOperator
src/main/utils/leaderboardSortingUtils.js:17:12
 export function sortByCowHealth(userCommonsArray, returnArraySize = userCommonsArray.length){
   //sorts in decreasing order, so the comparison function returns a negative when the first parameter is larger
   return userCommonsArray.sort((a, b) => {
-    return b.cowHealth - a.cowHealth;
+    return b.cowHealth + a.cowHealth;
   }).slice(0, returnArraySize);
 }
killedBy: leaderboardSortingUtils tests sortByCowHealth
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 98
Received: 2
